/**
 * \mainpage
 * <CENTER>
 * Варіант №4\n
 * --------------------------------------
 * </CENTER>
 * <div align="right">Виконав студент групи КМ-82: <B>Бубела Дмитро</B>\n</div>
 * ###Завдання:
 * Для кожного варіанту потрібно взяти шаблон структури із варіанту для Лабораторної
 * роботи №5 з відповідним номером. У кожному варіанті потрібно виконати всі дії зі
 * структурами, перераховані в попередній роботі, з урахуванням технології роботи
 * з однозв’язним списком, розміщеним у динамічній пам’яті. Написану програму потрібно
 * доповнити функціями з пунктів попереднього підрозділу. Виведення вмісту списку
 * (за відповідним пунктом меню) потрібно виконати у вигляді таблиці, стовпці якої
 * відповідають полям шаблону варіанту структури, а рядки — вмісту кожного екземпляра
 * структури зі сформованого списку. Поля під час виведення повинно бути
 * відформатовано за допомогою табуляції.\n
 * Для кожного з варіантів завдання потрібно розробити такі функції:\n
 * - створення списку;
 * - додавання елемента в список:
 *      -# у початок списку;
 *      -# у кінець списку;
 *      -# після елемента з заданим номером;
 *      -# після елемента з заданим ключем;
 * - видалення елемента зі списку:
 *      -# з початку списку;
 *      -# з кінця списку;
 *      -# із заданим номером;
 *      -# із заданим ключем;
 * - виведення вмісту списку на екран;
 * - упорядкування елементів списку за вибраною ознакою.\n
 * #### Основні функції, в тому числі для роботи з однозв'язним списком, знаходяться в файлі main.c.
 * На початку виконання програми виконується завдання з 5 лабораторної роботи task_1().
 * Для виконання цього завдання використовується спільний зв'язний список \c  *task1_list_head,
 * щоб його можна було використати в меню, через яке можна здійснити різноманітні функції за
 * бажанням користувача. Зауважте, що саме меню виконується функцією calling_menu(). Саме за її допомогою
 * здійснюється продовження роботи програми або її припинення. Для зручнішого та логічного користування
 * булевими змінними підключена бібліотека <stdbool.h>. Для детальнішого ознайомлення з роботою
 * меню перейдіть за посиланням menu()
 * ####\n Нижче наведений сирцевий код прорами
 * \includelineno main.c
 *
 */