/**
 * \mainpage
 * <CENTER>
 * Варіант №4\n
 * --------------------------------------
 * </CENTER>
 * <div align="right">Виконав студент групи КМ-82: <B>Бубела Дмитро</B>\n</div>
 * На початку виконяння програми виводиться інформація пов'язана з завданням(и) та автором.\n
 * Викликається функція choose_lab()
 * ###Завдання 1.1. Обчислити висоту паралелепіпеда.
 * ####Виконується функцією task1sub1()
 * \copydetails task1sub1()
 * ###Завдання 1.2. Обчислити Евклідову відстань між двома точками.
 * ####Виконується функцією task1sub2()
 * \copydetails task1sub2()
 * ###Завдання 2
 * Завдання складається з двох задач. У рамках завдання потрібно скласти дві підпрограми:
 *     - перша підпрограма уводить складові частини структури даних, наdеденої
 *       у відповідному варіанті індивідуального завдання, і формує з них
 *       задану упаковану структуру;
 *     - друга підпрограма уводить упаковану структуру як шістнадцяткове
 *       число й виводить значення окремих її складових частин.
 *
 * \copydetails task2()
 * ###Завдання 2.1.
 * \copydetails task2sub1()
 * ###Завдання 2.2.
 * \copydetails task2sub2()
 * ####\n Нижче наведений сирцевий код прорами
 * \includelineno main.c
 *
 */