/**
 * \mainpage
 * <CENTER>
 * Варіант №4\n
 * --------------------------------------
 * </CENTER>
 * <div align="right">Виконав студент групи КМ-82: <B>Бубела Дмитро</B>\n</div>
 * ###Завдання:
 * Завдання складається з двох частин:\n
 * програмування роботи з текстовим доступом до файлу;
 * програмування роботи з бінарним доступом до файлу.
 * Для обох програм повинно бути підготовлено вихідні файли:
 * для текстового файлу — не менше за 10 рядків;
 * для бінарного файлу — не менше за 10 структур, що відповідають
 * конкретному варіанту.\n
 * Для роботи з файлами повинно бути розроблено меню, пункти якого реалізовано
 * тільки за допомогою функцій. Пункти меню повинні бути такі:\n
 * створення нового файлу;\n
 * відкриття файлу;\n
 * перегляд файлу (перегортання вперед, назад, у кінець файлу, у початок файлу);\n
 * корекція файлу — дозапис, виправлення, видалення даних;\n
 * збереження файлу;\n
 * #### Основні функції знаходяться в файлі main.c.
 * Для реалізації дій з файлами використовується проміжний фай-кеш. Дані знаходяться у ньому допоки
 * користувач не збереже їх деінде.\n
 * Також для зручної роботи з функціями створене меню та функція для створення меню menu()
 * ####\n Нижче наведений сирцевий код прорами
 * \includelineno main.c
 *
 */