/**
 * \mainpage
 * <CENTER>
 * Варіант №4\n
 * --------------------------------------
 * </CENTER>
 * <div align="right">Виконав студент групи КМ-82: <B>Бубела Дмитро</B>\n</div>
 * На початку виконяння програми виводиться інформація пов'язана з завданням(и) та автором.\n
 * Викликається функція main()
 * ###Завдання 1. Визначити добуток найбільшого елемента в масиві A й найменшого елемента в масиві B.
 * ###Впорядкувати масив методом обмінного сортування по спадаючій\n
 * ####Виконується функцією task1()
 * Виконується введення розміру масиву. Вибирається спосіб його заповнення функцією rand_fill_1d()
 * або usr_fill_1d(). Вибір здійснюється оператором \c switch
 * \n Здійснюється вивід масиву print_arr_minmax()\n
 * Виконується сортування swaping_sort()\n
 * Здійснюється вивід відсортованого масиву print_arr_1d()\n
 * Звільняється оперативна пам'ять від масиву \c arr
 * ###Завдання 2. Дано матрицю з цілих чисел. Зібрати всі нульові елементи вище за головну діагональ (заповнення здійснювати паралельно головній діагоналі).
 * ####Виконується функцією task2()
 * Виконується введення розміру масиву, виділення пам'яті. Вибирається спосіб його заповнення функцією rand_fill_2d()
 * або usr_fill_2d(). Вибір здійснюється оператором \c switch
 * \n Здійснюється вивід масиву print_arr_2d_redzero()\n
 * Здійснюється переміщення нулів паралельно головній діагоналі zeros_to_begin_2d()\n
 * Здійснюється вивід масиву print_arr_2d_redzero(). Звільняється пам'ять.
 * ####\n Нижче наведений сирцевий код прорами
 * \includelineno main.c
 *
 */