/**
 * \mainpage
 * <CENTER>
 * Варіант №4\n
 * --------------------------------------
 * </CENTER>
 * <div align="right">Виконав студент групи КМ-82: <B>Бубела Дмитро</B>\n</div>
 * ###Завдання:
 * ###Дано матрицю A розмірності m*n. Обчислити суми елементів кожного стовпця.
 * ###Визначити найбільше значення цих сум і номер відповідного стовпця.
 * ####Виконується функцією task_1()
 * Для повтору виконання використовується функція to_repeat()\n
 * \copydetails task_1()
 * ####\n Нижче наведений сирцевий код прорами
 * \includelineno main.c
 *
 */