/**
 * \mainpage
 * <CENTER>
 * Варіант №4\n
 * --------------------------------------
 * </CENTER>
 * <div align="right">Виконав студент групи КМ-82: <B>Бубела Дмитро</B>\n</div>
 * На початку виконяння програми виводиться інформація пов'язана з завданням(и) та автором.\n
 * Викликається функція main() через функцію to_repeat()
 * ###Завдання 1. Дано текст. Виділити з нього всі слова, які не містять однакових символів. Різницю малих і великих літер до уваги не брати.
 * ####Виконується функцією task_1()
 * \copydetails task_1()
 * ####\n Нижче наведений сирцевий код прорами
 * \includelineno main.c
 */