/**
 * \mainpage
 * <CENTER>
 * Варіант №4\n
 * --------------------------------------
 * </CENTER>
 * <div align="right">Виконав студент групи КМ-82: <B>Бубела Дмитро</B>\n</div>
 * ###Завдання:
 * ###1. Описати структуру з іменем AEROFLOT, що містить такі поля:
 * ### - назва пункту призначення рейсу;
 * ### - номер рейсу;
 * ### - тип літака.
 * ###2. Написати програму, що виконує такі дії:
 * ### - уведення з клавіатури даних у масив із 5 структур типу AEROFLOT;
 * ### - упорядкування записів за зростанням номера рейсу;
 * ### - виведення на екран номерів рейсів і типів літаків, що вилітають у пункт призначення, назва якого збігається з назвою, уведеною з клавіатури;
 * ###якщо таких рейсів немає, вивести на екран відповідне повідомлення.\n
 * ####Виконується функцією task_1()
 * \copydetails task_1()
 * ####\n Нижче наведений сирцевий код прорами
 * \includelineno main.c
 *
 */