/**
 * \mainpage
 * <CENTER>
 * Варіант №4\n
 * --------------------------------------
 * </CENTER>
 * <div align="right">Виконав студент групи КМ-82: <B>Бубела Дмитро</B>\n</div>
 * ###Завдання 1.1 Округлення дійсного числа до значення з заданою точністю
 * ####Виконується функцією task_1_1()
 * \copydetails task_1_1()
 * ###Завдання 1.2 визначення послідовності чисел, що ділять задане число націло
 * ####Виконується функцією task_1_2()
 * \copydetails task_1_2()
 * ###Завдання 2 Написати рекурсивну функцію, яка обчислює довжину рядка
 * ####Виконується функцією task_2()
 * \copydetails task_2()
 * ####\n Нижче наведений сирцевий код прорами
 * \includelineno main.c
 */